app/graphql/types/mutation_type.rb

INSERT INTO "users" ("id", "first_name", "last_name", "street", "number", "city", "zipcode", "country", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
    def create_user(user:)
      User.create user.to_h

SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 8]]
---
    def delete_user(id:)
      User.where(id: id).destroy_all

INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "This is a test post"], ["user_id", 1], ["created_at", "2019-07-31 00:38:05.944769"], ["updated_at", "2019-07-31 00:38:05.944769"]]
---
    def create_post(post:)
      Post.create post.to_h

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "This is a new test post"], ["updated_at", "2019-07-31 00:46:10.397929"], ["id", 7]]
---
    def update_post(post:)
      existing = Post.where(id: post[:id]).first
      existing.update post.to_h

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 8]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1  [["id", 8]]
---
    def delete_post(id:)
      Post.where(id: id).destroy_all

INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Wakka wakka FLAKKA!!"], ["post_id", 10], ["created_at", "2019-07-31 01:05:52.112768"], ["updated_at", "2019-07-31 01:05:52.112768"]]
---
    def create_comment(comment:)
      Comment.create comment.to_h

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 ORDER BY "comments"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "Wakka wakka FLAKKA!! FLAAAAAAKA"], ["updated_at", "2019-07-31 01:07:05.602528"], ["id", 11]]
---
    def update_comment(comment:)
      existing = Comment.where(id: comment[:id]).first
      existing.update comment.to_h

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 10]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1  [["id", 10]]
---
    def delete_comment(id:)
      Comment.where(id: id).destroy_all