app/graphql/types/query_type.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "a@b.com"], ["LIMIT", 1]]
---
    def login(email:, password:)
      if user = User.where(email: email).first&.authenticate(password)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3456], ["LIMIT", 1]]
---
    def user(id:)
      User.where(id: id).first